In [170]:
import pandas as pd
import numpy as np
import csv
import string

In [171]:
yearlysales = "EV Yearly sales.csv"

In [172]:
yearlysales_df= pd.read_csv(yearlysales,encoding = "ISO-8859-1",error_bad_lines=False)
yearlysales_df=yearlysales_df[:-1]

In [173]:
yearlysales_df.head()

,Model,Type,2011,2012,2013,2014,2015,2016,2017,TOTAL
0,Nissan LEAF,EV,"9,674","9,819","22,610","30,200","17,269","14,006","11,230","103,578"
1,Chevrolet Volt PHEV,PHEV,"7,671","23,461","23,094","18,805","15,393","24,739","20,349","113,163"
2,Tesla Model S,EV,0,"2,171","19,000","16,750","26,200","29,156","27,060","93,277"
3,Toyota Prius Prime Plug-in,PHEV,0,"12,749","12,088","13,264","4,191","2,474","20,936","44,766"
4,Ford Fusion Energi,PHEV,0,0,"6,089","11,550","9,750","15,938","9,632","43,327"

In [174]:
yearlysales_df1 = yearlysales_df.apply(lambda x: pd.to_numeric(x.str.replace(',',''), errors='coerce'))
yearlysales_df1.head()

   Model  Type  2011   2012   2013   2014   2015     2016     2017   TOTAL
0    NaN   NaN  9674   9819  22610  30200  17269  14006.0  11230.0  103578
1    NaN   NaN  7671  23461  23094  18805  15393  24739.0  20349.0  113163
2    NaN   NaN     0   2171  19000  16750  26200  29156.0  27060.0   93277
3    NaN   NaN     0  12749  12088  13264   4191   2474.0  20936.0   44766
4    NaN   NaN     0      0   6089  11550   9750  15938.0   9632.0   43327

In [178]:
Total_Purchases_df = yearlysales_df1[["2011","2012","2013","2014","2015","2016","2017"]].sum()
Total_Purchases_df

2011     17731.0
2012     53234.0
2013     96702.0
2014    118773.0
2015    115079.0
2016    144035.0
2017    149484.0
dtype: float64